//  Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
//456 -> 5
//782 -> 8
//918 -> 1

int a = 456;
Console.WriteLine(a);
Console.WriteLine((a % 100) / 10);

int b = 782;
Console.WriteLine(b);
Console.WriteLine((b % 100) / 10);

int c = 918;
Console.WriteLine(c);
Console.WriteLine((c % 100) / 10);

