//Напишите программу, которая принимает на вход число и проверяет кратно ли оно одновременно 7 и 23
//14->нет
//46->нет
//161->да

Console.Write("Введите число: ");
double value1 = Convert.ToDouble(Console.ReadLine());

if (())




if ((value1 / value2) == 0) {
    Console.WriteLine ("Делится без остатка");
}
else {
    Console.WriteLine ("Делится с остатком");