// Напишите программу, которая на вход принимает число и выдает его квадрат
// Например:
// - 4 6
// - 3 9
// - 7 49





int value = 11;
int result = value * value;
Console.WriteLine(result);

